luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDsadc_bf.h
/** \brief  Length for Ifx_DSADC_ACCEN0_Bits.EN27 */
#define IFX_DSADC_ACCEN0_EN27_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN27 */
#define IFX_DSADC_ACCEN0_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN27 */
#define IFX_DSADC_ACCEN0_EN27_OFF (27u)

/** \brief  Length for Ifx_DSADC_ACCEN0_Bits.EN28 */
#define IFX_DSADC_ACCEN0_EN28_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN28 */
#define IFX_DSADC_ACCEN0_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN28 */
#define IFX_DSADC_ACCEN0_EN28_OFF (28u)

/** \brief  Length for Ifx_DSADC_ACCEN0_Bits.EN29 */
#define IFX_DSADC_ACCEN0_EN29_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN29 */
#define IFX_DSADC_ACCEN0_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN29 */
#define IFX_DSADC_ACCEN0_EN29_OFF (29u)

/** \brief  Length for Ifx_DSADC_ACCEN0_Bits.EN2 */
#define IFX_DSADC_ACCEN0_EN2_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN2 */
#define IFX_DSADC_ACCEN0_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN2 */
#define IFX_DSADC_ACCEN0_EN2_OFF (2u)

/** \brief  Length for Ifx_DSADC_ACCEN0_Bits.EN30 */
#define IFX_DSADC_ACCEN0_EN30_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN30 */
#define IFX_DSADC_ACCEN0_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN30 */
#define IFX_DSADC_ACCEN0_EN30_OFF (30u)

/** \brief  Length for Ifx_DSADC_ACCEN0_Bits.EN31 */
#define IFX_DSADC_ACCEN0_EN31_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN31 */
#define IFX_DSADC_ACCEN0_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN31 */
#define IFX_DSADC_ACCEN0_EN31_OFF (31u)

/** \brief  Length for Ifx_DSADC_ACCEN0_Bits.EN3 */
#define IFX_DSADC_ACCEN0_EN3_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN3 */
#define IFX_DSADC_ACCEN0_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN3 */
#define IFX_DSADC_ACCEN0_EN3_OFF (3u)

/** \brief  Length for Ifx_DSADC_ACCEN0_Bits.EN4 */
#define IFX_DSADC_ACCEN0_EN4_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN4 */
#define IFX_DSADC_ACCEN0_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN4 */
#define IFX_DSADC_ACCEN0_EN4_OFF (4u)

/** \brief  Length for Ifx_DSADC_ACCEN0_Bits.EN5 */
#define IFX_DSADC_ACCEN0_EN5_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN5 */
#define IFX_DSADC_ACCEN0_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN5 */
#define IFX_DSADC_ACCEN0_EN5_OFF (5u)

/** \brief  Length for Ifx_DSADC_ACCEN0_Bits.EN6 */
#define IFX_DSADC_ACCEN0_EN6_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN6 */
#define IFX_DSADC_ACCEN0_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN6 */
#define IFX_DSADC_ACCEN0_EN6_OFF (6u)

/** \brief  Length for Ifx_DSADC_ACCEN0_Bits.EN7 */
#define IFX_DSADC_ACCEN0_EN7_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN7 */
#define IFX_DSADC_ACCEN0_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN7 */
#define IFX_DSADC_ACCEN0_EN7_OFF (7u)

/** \brief  Length for Ifx_DSADC_ACCEN0_Bits.EN8 */
#define IFX_DSADC_ACCEN0_EN8_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN8 */
#define IFX_DSADC_ACCEN0_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN8 */
#define IFX_DSADC_ACCEN0_EN8_OFF (8u)

/** \brief  Length for Ifx_DSADC_ACCEN0_Bits.EN9 */
#define IFX_DSADC_ACCEN0_EN9_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCEN0_Bits.EN9 */
#define IFX_DSADC_ACCEN0_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCEN0_Bits.EN9 */
#define IFX_DSADC_ACCEN0_EN9_OFF (9u)

/** \brief  Length for Ifx_DSADC_ACCPROT_Bits.RG00 */
#define IFX_DSADC_ACCPROT_RG00_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG00 */
#define IFX_DSADC_ACCPROT_RG00_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG00 */
#define IFX_DSADC_ACCPROT_RG00_OFF (0u)

/** \brief  Length for Ifx_DSADC_ACCPROT_Bits.RG01 */
#define IFX_DSADC_ACCPROT_RG01_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG01 */
#define IFX_DSADC_ACCPROT_RG01_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG01 */
#define IFX_DSADC_ACCPROT_RG01_OFF (1u)

/** \brief  Length for Ifx_DSADC_ACCPROT_Bits.RG02 */
#define IFX_DSADC_ACCPROT_RG02_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG02 */
#define IFX_DSADC_ACCPROT_RG02_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG02 */
#define IFX_DSADC_ACCPROT_RG02_OFF (2u)

/** \brief  Length for Ifx_DSADC_ACCPROT_Bits.RG03 */
#define IFX_DSADC_ACCPROT_RG03_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG03 */
#define IFX_DSADC_ACCPROT_RG03_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG03 */
#define IFX_DSADC_ACCPROT_RG03_OFF (3u)

/** \brief  Length for Ifx_DSADC_ACCPROT_Bits.RG04 */
#define IFX_DSADC_ACCPROT_RG04_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG04 */
#define IFX_DSADC_ACCPROT_RG04_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG04 */
#define IFX_DSADC_ACCPROT_RG04_OFF (4u)

/** \brief  Length for Ifx_DSADC_ACCPROT_Bits.RG10 */
#define IFX_DSADC_ACCPROT_RG10_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG10 */
#define IFX_DSADC_ACCPROT_RG10_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG10 */
#define IFX_DSADC_ACCPROT_RG10_OFF (14u)

/** \brief  Length for Ifx_DSADC_ACCPROT_Bits.RG11 */
#define IFX_DSADC_ACCPROT_RG11_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG11 */
#define IFX_DSADC_ACCPROT_RG11_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG11 */
#define IFX_DSADC_ACCPROT_RG11_OFF (15u)

/** \brief  Length for Ifx_DSADC_ACCPROT_Bits.RG40 */
#define IFX_DSADC_ACCPROT_RG40_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG40 */
#define IFX_DSADC_ACCPROT_RG40_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG40 */
#define IFX_DSADC_ACCPROT_RG40_OFF (16u)

/** \brief  Length for Ifx_DSADC_ACCPROT_Bits.RG41 */
#define IFX_DSADC_ACCPROT_RG41_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG41 */
#define IFX_DSADC_ACCPROT_RG41_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG41 */
#define IFX_DSADC_ACCPROT_RG41_OFF (17u)

/** \brief  Length for Ifx_DSADC_ACCPROT_Bits.RG42 */
#define IFX_DSADC_ACCPROT_RG42_LEN (1u)

/** \brief  Mask for Ifx_DSADC_ACCPROT_Bits.RG42 */
#define IFX_DSADC_ACCPROT_RG42_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_ACCPROT_Bits.RG42 */
#define IFX_DSADC_ACCPROT_RG42_OFF (18u)

