luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDsadc_bf.h
/** \brief  Offset for Ifx_DSADC_CH_FCFGM_Bits.FIR1EN */
#define IFX_DSADC_CH_FCFGM_FIR1EN_OFF (1u)

/** \brief  Length for Ifx_DSADC_CH_FCFGM_Bits.FSH */
#define IFX_DSADC_CH_FCFGM_FSH_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_FCFGM_Bits.FSH */
#define IFX_DSADC_CH_FCFGM_FSH_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_FCFGM_Bits.FSH */
#define IFX_DSADC_CH_FCFGM_FSH_OFF (5u)

/** \brief  Length for Ifx_DSADC_CH_FCFGM_Bits.OCEN */
#define IFX_DSADC_CH_FCFGM_OCEN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_FCFGM_Bits.OCEN */
#define IFX_DSADC_CH_FCFGM_OCEN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_FCFGM_Bits.OCEN */
#define IFX_DSADC_CH_FCFGM_OCEN_OFF (2u)

/** \brief  Length for Ifx_DSADC_CH_IWCTR_Bits.INTEN */
#define IFX_DSADC_CH_IWCTR_INTEN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.INTEN */
#define IFX_DSADC_CH_IWCTR_INTEN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.INTEN */
#define IFX_DSADC_CH_IWCTR_INTEN_OFF (7u)

/** \brief  Length for Ifx_DSADC_CH_IWCTR_Bits.IWS */
#define IFX_DSADC_CH_IWCTR_IWS_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.IWS */
#define IFX_DSADC_CH_IWCTR_IWS_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.IWS */
#define IFX_DSADC_CH_IWCTR_IWS_OFF (23u)

/** \brief  Length for Ifx_DSADC_CH_IWCTR_Bits.NVALCNT */
#define IFX_DSADC_CH_IWCTR_NVALCNT_LEN (6u)

/** \brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.NVALCNT */
#define IFX_DSADC_CH_IWCTR_NVALCNT_MSK (0x3fu)

/** \brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.NVALCNT */
#define IFX_DSADC_CH_IWCTR_NVALCNT_OFF (0u)

/** \brief  Length for Ifx_DSADC_CH_IWCTR_Bits.NVALDIS */
#define IFX_DSADC_CH_IWCTR_NVALDIS_LEN (6u)

/** \brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.NVALDIS */
#define IFX_DSADC_CH_IWCTR_NVALDIS_MSK (0x3fu)

/** \brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.NVALDIS */
#define IFX_DSADC_CH_IWCTR_NVALDIS_OFF (16u)

/** \brief  Length for Ifx_DSADC_CH_IWCTR_Bits.NVALINT */
#define IFX_DSADC_CH_IWCTR_NVALINT_LEN (6u)

/** \brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.NVALINT */
#define IFX_DSADC_CH_IWCTR_NVALINT_MSK (0x3fu)

/** \brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.NVALINT */
#define IFX_DSADC_CH_IWCTR_NVALINT_OFF (24u)

/** \brief  Length for Ifx_DSADC_CH_IWCTR_Bits.REPCNT */
#define IFX_DSADC_CH_IWCTR_REPCNT_LEN (4u)

/** \brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.REPCNT */
#define IFX_DSADC_CH_IWCTR_REPCNT_MSK (0xfu)

/** \brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.REPCNT */
#define IFX_DSADC_CH_IWCTR_REPCNT_OFF (8u)

/** \brief  Length for Ifx_DSADC_CH_IWCTR_Bits.REPVAL */
#define IFX_DSADC_CH_IWCTR_REPVAL_LEN (4u)

/** \brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.REPVAL */
#define IFX_DSADC_CH_IWCTR_REPVAL_MSK (0xfu)

/** \brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.REPVAL */
#define IFX_DSADC_CH_IWCTR_REPVAL_OFF (12u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.APC */
#define IFX_DSADC_CH_MODCFG_APC_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.APC */
#define IFX_DSADC_CH_MODCFG_APC_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.APC */
#define IFX_DSADC_CH_MODCFG_APC_OFF (29u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.CMVS */
#define IFX_DSADC_CH_MODCFG_CMVS_LEN (2u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.CMVS */
#define IFX_DSADC_CH_MODCFG_CMVS_MSK (0x3u)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.CMVS */
#define IFX_DSADC_CH_MODCFG_CMVS_OFF (24u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.DIVM */
#define IFX_DSADC_CH_MODCFG_DIVM_LEN (4u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.DIVM */
#define IFX_DSADC_CH_MODCFG_DIVM_MSK (0xfu)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.DIVM */
#define IFX_DSADC_CH_MODCFG_DIVM_OFF (16u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.DWC */
#define IFX_DSADC_CH_MODCFG_DWC_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.DWC */
#define IFX_DSADC_CH_MODCFG_DWC_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.DWC */
#define IFX_DSADC_CH_MODCFG_DWC_OFF (23u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.GAINSEL */
#define IFX_DSADC_CH_MODCFG_GAINSEL_LEN (4u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.GAINSEL */
#define IFX_DSADC_CH_MODCFG_GAINSEL_MSK (0xfu)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.GAINSEL */
#define IFX_DSADC_CH_MODCFG_GAINSEL_OFF (4u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.GCEN */
#define IFX_DSADC_CH_MODCFG_GCEN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.GCEN */
#define IFX_DSADC_CH_MODCFG_GCEN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.GCEN */
#define IFX_DSADC_CH_MODCFG_GCEN_OFF (28u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INCFGN */
#define IFX_DSADC_CH_MODCFG_INCFGN_LEN (2u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INCFGN */
#define IFX_DSADC_CH_MODCFG_INCFGN_MSK (0x3u)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INCFGN */
#define IFX_DSADC_CH_MODCFG_INCFGN_OFF (2u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INCFGP */
#define IFX_DSADC_CH_MODCFG_INCFGP_LEN (2u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INCFGP */
#define IFX_DSADC_CH_MODCFG_INCFGP_MSK (0x3u)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INCFGP */
#define IFX_DSADC_CH_MODCFG_INCFGP_OFF (0u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INCWC */
#define IFX_DSADC_CH_MODCFG_INCWC_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INCWC */
#define IFX_DSADC_CH_MODCFG_INCWC_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INCWC */
#define IFX_DSADC_CH_MODCFG_INCWC_OFF (15u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INMAC */
#define IFX_DSADC_CH_MODCFG_INMAC_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INMAC */
#define IFX_DSADC_CH_MODCFG_INMAC_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INMAC */
#define IFX_DSADC_CH_MODCFG_INMAC_OFF (14u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INMODE */
#define IFX_DSADC_CH_MODCFG_INMODE_LEN (2u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INMODE */
#define IFX_DSADC_CH_MODCFG_INMODE_MSK (0x3u)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INMODE */
#define IFX_DSADC_CH_MODCFG_INMODE_OFF (12u)

