luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDsadc_bf.h
/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INMUX */
#define IFX_DSADC_CH_MODCFG_INMUX_LEN (2u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INMUX */
#define IFX_DSADC_CH_MODCFG_INMUX_MSK (0x3u)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INMUX */
#define IFX_DSADC_CH_MODCFG_INMUX_OFF (10u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INSEL */
#define IFX_DSADC_CH_MODCFG_INSEL_LEN (2u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INSEL */
#define IFX_DSADC_CH_MODCFG_INSEL_MSK (0x3u)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INSEL */
#define IFX_DSADC_CH_MODCFG_INSEL_OFF (8u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.MCFG */
#define IFX_DSADC_CH_MODCFG_MCFG_LEN (2u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.MCFG */
#define IFX_DSADC_CH_MODCFG_MCFG_MSK (0x3u)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.MCFG */
#define IFX_DSADC_CH_MODCFG_MCFG_OFF (26u)

/** \brief  Length for Ifx_DSADC_CH_MODCFG_Bits.MWC */
#define IFX_DSADC_CH_MODCFG_MWC_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.MWC */
#define IFX_DSADC_CH_MODCFG_MWC_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.MWC */
#define IFX_DSADC_CH_MODCFG_MWC_OFF (31u)

/** \brief  Length for Ifx_DSADC_CH_OFFM_Bits.OFFSET */
#define IFX_DSADC_CH_OFFM_OFFSET_LEN (16u)

/** \brief  Mask for Ifx_DSADC_CH_OFFM_Bits.OFFSET */
#define IFX_DSADC_CH_OFFM_OFFSET_MSK (0xffffu)

/** \brief  Offset for Ifx_DSADC_CH_OFFM_Bits.OFFSET */
#define IFX_DSADC_CH_OFFM_OFFSET_OFF (0u)

/** \brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.RFEN */
#define IFX_DSADC_CH_RECTCFG_RFEN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.RFEN */
#define IFX_DSADC_CH_RECTCFG_RFEN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.RFEN */
#define IFX_DSADC_CH_RECTCFG_RFEN_OFF (0u)

/** \brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.SDCVAL */
#define IFX_DSADC_CH_RECTCFG_SDCVAL_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.SDCVAL */
#define IFX_DSADC_CH_RECTCFG_SDCVAL_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.SDCVAL */
#define IFX_DSADC_CH_RECTCFG_SDCVAL_OFF (15u)

/** \brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.SGNCS */
#define IFX_DSADC_CH_RECTCFG_SGNCS_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.SGNCS */
#define IFX_DSADC_CH_RECTCFG_SGNCS_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.SGNCS */
#define IFX_DSADC_CH_RECTCFG_SGNCS_OFF (30u)

/** \brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.SGND */
#define IFX_DSADC_CH_RECTCFG_SGND_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.SGND */
#define IFX_DSADC_CH_RECTCFG_SGND_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.SGND */
#define IFX_DSADC_CH_RECTCFG_SGND_OFF (31u)

/** \brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.SSRC */
#define IFX_DSADC_CH_RECTCFG_SSRC_LEN (2u)

/** \brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.SSRC */
#define IFX_DSADC_CH_RECTCFG_SSRC_MSK (0x3u)

/** \brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.SSRC */
#define IFX_DSADC_CH_RECTCFG_SSRC_OFF (4u)

/** \brief  Length for Ifx_DSADC_CH_RESA_Bits.RESULT */
#define IFX_DSADC_CH_RESA_RESULT_LEN (16u)

/** \brief  Mask for Ifx_DSADC_CH_RESA_Bits.RESULT */
#define IFX_DSADC_CH_RESA_RESULT_MSK (0xffffu)

/** \brief  Offset for Ifx_DSADC_CH_RESA_Bits.RESULT */
#define IFX_DSADC_CH_RESA_RESULT_OFF (0u)

/** \brief  Length for Ifx_DSADC_CH_RESM_Bits.RESULT */
#define IFX_DSADC_CH_RESM_RESULT_LEN (16u)

/** \brief  Mask for Ifx_DSADC_CH_RESM_Bits.RESULT */
#define IFX_DSADC_CH_RESM_RESULT_MSK (0xffffu)

/** \brief  Offset for Ifx_DSADC_CH_RESM_Bits.RESULT */
#define IFX_DSADC_CH_RESM_RESULT_OFF (0u)

/** \brief  Length for Ifx_DSADC_CH_TSTMP_Bits.CFMDCNT */
#define IFX_DSADC_CH_TSTMP_CFMDCNT_LEN (8u)

/** \brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.CFMDCNT */
#define IFX_DSADC_CH_TSTMP_CFMDCNT_MSK (0xffu)

/** \brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.CFMDCNT */
#define IFX_DSADC_CH_TSTMP_CFMDCNT_OFF (16u)

/** \brief  Length for Ifx_DSADC_CH_TSTMP_Bits.NVALCNT */
#define IFX_DSADC_CH_TSTMP_NVALCNT_LEN (6u)

/** \brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.NVALCNT */
#define IFX_DSADC_CH_TSTMP_NVALCNT_MSK (0x3fu)

/** \brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.NVALCNT */
#define IFX_DSADC_CH_TSTMP_NVALCNT_OFF (24u)

/** \brief  Length for Ifx_DSADC_CH_TSTMP_Bits.RESULT */
#define IFX_DSADC_CH_TSTMP_RESULT_LEN (16u)

/** \brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.RESULT */
#define IFX_DSADC_CH_TSTMP_RESULT_MSK (0xffffu)

/** \brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.RESULT */
#define IFX_DSADC_CH_TSTMP_RESULT_OFF (0u)

/** \brief  Length for Ifx_DSADC_CH_TSTMP_Bits.TSSR */
#define IFX_DSADC_CH_TSTMP_TSSR_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.TSSR */
#define IFX_DSADC_CH_TSTMP_TSSR_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.TSSR */
#define IFX_DSADC_CH_TSTMP_TSSR_OFF (31u)

/** \brief  Length for Ifx_DSADC_CH_TSTMP_Bits.TSVAL */
#define IFX_DSADC_CH_TSTMP_TSVAL_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.TSVAL */
#define IFX_DSADC_CH_TSTMP_TSVAL_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.TSVAL */
#define IFX_DSADC_CH_TSTMP_TSVAL_OFF (30u)

/** \brief  Length for Ifx_DSADC_CLC_Bits.DISR */
#define IFX_DSADC_CLC_DISR_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CLC_Bits.DISR */
#define IFX_DSADC_CLC_DISR_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CLC_Bits.DISR */
#define IFX_DSADC_CLC_DISR_OFF (0u)

/** \brief  Length for Ifx_DSADC_CLC_Bits.DISS */
#define IFX_DSADC_CLC_DISS_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CLC_Bits.DISS */
#define IFX_DSADC_CLC_DISS_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CLC_Bits.DISS */
#define IFX_DSADC_CLC_DISS_OFF (1u)

/** \brief  Length for Ifx_DSADC_CLC_Bits.EDIS */
#define IFX_DSADC_CLC_EDIS_LEN (1u)

/** \brief  Mask for Ifx_DSADC_CLC_Bits.EDIS */
#define IFX_DSADC_CLC_EDIS_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_CLC_Bits.EDIS */
#define IFX_DSADC_CLC_EDIS_OFF (3u)

/** \brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV0 */
#define IFX_DSADC_EVFLAG_ALEV0_LEN (1u)

