luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDsadc_bf.h
/** \brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV0 */
#define IFX_DSADC_EVFLAG_ALEV0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV0 */
#define IFX_DSADC_EVFLAG_ALEV0_OFF (16u)

/** \brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV1 */
#define IFX_DSADC_EVFLAG_ALEV1_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV1 */
#define IFX_DSADC_EVFLAG_ALEV1_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV1 */
#define IFX_DSADC_EVFLAG_ALEV1_OFF (17u)

/** \brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV2 */
#define IFX_DSADC_EVFLAG_ALEV2_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV2 */
#define IFX_DSADC_EVFLAG_ALEV2_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV2 */
#define IFX_DSADC_EVFLAG_ALEV2_OFF (18u)

/** \brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV3 */
#define IFX_DSADC_EVFLAG_ALEV3_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV3 */
#define IFX_DSADC_EVFLAG_ALEV3_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV3 */
#define IFX_DSADC_EVFLAG_ALEV3_OFF (19u)

/** \brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV4 */
#define IFX_DSADC_EVFLAG_ALEV4_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV4 */
#define IFX_DSADC_EVFLAG_ALEV4_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV4 */
#define IFX_DSADC_EVFLAG_ALEV4_OFF (20u)

/** \brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV5 */
#define IFX_DSADC_EVFLAG_ALEV5_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV5 */
#define IFX_DSADC_EVFLAG_ALEV5_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV5 */
#define IFX_DSADC_EVFLAG_ALEV5_OFF (21u)

/** \brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV0 */
#define IFX_DSADC_EVFLAG_RESEV0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV0 */
#define IFX_DSADC_EVFLAG_RESEV0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV0 */
#define IFX_DSADC_EVFLAG_RESEV0_OFF (0u)

/** \brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV1 */
#define IFX_DSADC_EVFLAG_RESEV1_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV1 */
#define IFX_DSADC_EVFLAG_RESEV1_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV1 */
#define IFX_DSADC_EVFLAG_RESEV1_OFF (1u)

/** \brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV2 */
#define IFX_DSADC_EVFLAG_RESEV2_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV2 */
#define IFX_DSADC_EVFLAG_RESEV2_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV2 */
#define IFX_DSADC_EVFLAG_RESEV2_OFF (2u)

/** \brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV3 */
#define IFX_DSADC_EVFLAG_RESEV3_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV3 */
#define IFX_DSADC_EVFLAG_RESEV3_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV3 */
#define IFX_DSADC_EVFLAG_RESEV3_OFF (3u)

/** \brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV4 */
#define IFX_DSADC_EVFLAG_RESEV4_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV4 */
#define IFX_DSADC_EVFLAG_RESEV4_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV4 */
#define IFX_DSADC_EVFLAG_RESEV4_OFF (4u)

/** \brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV5 */
#define IFX_DSADC_EVFLAG_RESEV5_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV5 */
#define IFX_DSADC_EVFLAG_RESEV5_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAG_Bits.RESEV5 */
#define IFX_DSADC_EVFLAG_RESEV5_OFF (5u)

/** \brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_DSADC_EVFLAGCLR_ALEC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_DSADC_EVFLAGCLR_ALEC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_DSADC_EVFLAGCLR_ALEC0_OFF (16u)

/** \brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC1 */
#define IFX_DSADC_EVFLAGCLR_ALEC1_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC1 */
#define IFX_DSADC_EVFLAGCLR_ALEC1_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC1 */
#define IFX_DSADC_EVFLAGCLR_ALEC1_OFF (17u)

/** \brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_DSADC_EVFLAGCLR_ALEC2_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_DSADC_EVFLAGCLR_ALEC2_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_DSADC_EVFLAGCLR_ALEC2_OFF (18u)

/** \brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_DSADC_EVFLAGCLR_ALEC3_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_DSADC_EVFLAGCLR_ALEC3_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_DSADC_EVFLAGCLR_ALEC3_OFF (19u)

/** \brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC4 */
#define IFX_DSADC_EVFLAGCLR_ALEC4_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC4 */
#define IFX_DSADC_EVFLAGCLR_ALEC4_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC4 */
#define IFX_DSADC_EVFLAGCLR_ALEC4_OFF (20u)

/** \brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.ALEC5 */
#define IFX_DSADC_EVFLAGCLR_ALEC5_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.ALEC5 */
#define IFX_DSADC_EVFLAGCLR_ALEC5_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.ALEC5 */
#define IFX_DSADC_EVFLAGCLR_ALEC5_OFF (21u)

/** \brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC0 */
#define IFX_DSADC_EVFLAGCLR_RESEC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC0 */
#define IFX_DSADC_EVFLAGCLR_RESEC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC0 */
#define IFX_DSADC_EVFLAGCLR_RESEC0_OFF (0u)

/** \brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC1 */
#define IFX_DSADC_EVFLAGCLR_RESEC1_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC1 */
#define IFX_DSADC_EVFLAGCLR_RESEC1_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC1 */
#define IFX_DSADC_EVFLAGCLR_RESEC1_OFF (1u)

/** \brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC2 */
#define IFX_DSADC_EVFLAGCLR_RESEC2_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC2 */
#define IFX_DSADC_EVFLAGCLR_RESEC2_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC2 */
#define IFX_DSADC_EVFLAGCLR_RESEC2_OFF (2u)

/** \brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC3 */
#define IFX_DSADC_EVFLAGCLR_RESEC3_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC3 */
#define IFX_DSADC_EVFLAGCLR_RESEC3_MSK (0x1u)

