luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDsadc_bf.h
/** \brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC3 */
#define IFX_DSADC_EVFLAGCLR_RESEC3_OFF (3u)

/** \brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC4 */
#define IFX_DSADC_EVFLAGCLR_RESEC4_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC4 */
#define IFX_DSADC_EVFLAGCLR_RESEC4_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC4 */
#define IFX_DSADC_EVFLAGCLR_RESEC4_OFF (4u)

/** \brief  Length for Ifx_DSADC_EVFLAGCLR_Bits.RESEC5 */
#define IFX_DSADC_EVFLAGCLR_RESEC5_LEN (1u)

/** \brief  Mask for Ifx_DSADC_EVFLAGCLR_Bits.RESEC5 */
#define IFX_DSADC_EVFLAGCLR_RESEC5_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_EVFLAGCLR_Bits.RESEC5 */
#define IFX_DSADC_EVFLAGCLR_RESEC5_OFF (5u)

/** \brief  Length for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_LEN (4u)

/** \brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_MSK (0xfu)

/** \brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IBSEL */
#define IFX_DSADC_GLOBCFG_IBSEL_OFF (16u)

/** \brief  Length for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBCFG_Bits.ICT */
#define IFX_DSADC_GLOBCFG_ICT_OFF (22u)

/** \brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM0 */
#define IFX_DSADC_GLOBCFG_IRM0_OFF (11u)

/** \brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM2 */
#define IFX_DSADC_GLOBCFG_IRM2_OFF (12u)

/** \brief  Length for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBCFG_Bits.IRM4 */
#define IFX_DSADC_GLOBCFG_IRM4_OFF (13u)

/** \brief  Length for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBCFG_Bits.LOSUP */
#define IFX_DSADC_GLOBCFG_LOSUP_OFF (20u)

/** \brief  Length for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_LEN (3u)

/** \brief  Mask for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_MSK (0x7u)

/** \brief  Offset for Ifx_DSADC_GLOBCFG_Bits.MCSEL */
#define IFX_DSADC_GLOBCFG_MCSEL_OFF (0u)

/** \brief  Length for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBCFG_Bits.PSWC */
#define IFX_DSADC_GLOBCFG_PSWC_OFF (23u)

/** \brief  Length for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH0RUN */
#define IFX_DSADC_GLOBRC_CH0RUN_OFF (0u)

/** \brief  Length for Ifx_DSADC_GLOBRC_Bits.CH1RUN */
#define IFX_DSADC_GLOBRC_CH1RUN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH1RUN */
#define IFX_DSADC_GLOBRC_CH1RUN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH1RUN */
#define IFX_DSADC_GLOBRC_CH1RUN_OFF (1u)

/** \brief  Length for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH2RUN */
#define IFX_DSADC_GLOBRC_CH2RUN_OFF (2u)

/** \brief  Length for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH3RUN */
#define IFX_DSADC_GLOBRC_CH3RUN_OFF (3u)

/** \brief  Length for Ifx_DSADC_GLOBRC_Bits.CH4RUN */
#define IFX_DSADC_GLOBRC_CH4RUN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH4RUN */
#define IFX_DSADC_GLOBRC_CH4RUN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH4RUN */
#define IFX_DSADC_GLOBRC_CH4RUN_OFF (4u)

/** \brief  Length for Ifx_DSADC_GLOBRC_Bits.CH5RUN */
#define IFX_DSADC_GLOBRC_CH5RUN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBRC_Bits.CH5RUN */
#define IFX_DSADC_GLOBRC_CH5RUN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBRC_Bits.CH5RUN */
#define IFX_DSADC_GLOBRC_CH5RUN_OFF (5u)

/** \brief  Length for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBRC_Bits.M0RUN */
#define IFX_DSADC_GLOBRC_M0RUN_OFF (16u)

/** \brief  Length for Ifx_DSADC_GLOBRC_Bits.M1RUN */
#define IFX_DSADC_GLOBRC_M1RUN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBRC_Bits.M1RUN */
#define IFX_DSADC_GLOBRC_M1RUN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBRC_Bits.M1RUN */
#define IFX_DSADC_GLOBRC_M1RUN_OFF (17u)

/** \brief  Length for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBRC_Bits.M2RUN */
#define IFX_DSADC_GLOBRC_M2RUN_OFF (18u)

/** \brief  Length for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBRC_Bits.M3RUN */
#define IFX_DSADC_GLOBRC_M3RUN_OFF (19u)

/** \brief  Length for Ifx_DSADC_GLOBRC_Bits.M4RUN */
#define IFX_DSADC_GLOBRC_M4RUN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBRC_Bits.M4RUN */
#define IFX_DSADC_GLOBRC_M4RUN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBRC_Bits.M4RUN */
#define IFX_DSADC_GLOBRC_M4RUN_OFF (20u)

/** \brief  Length for Ifx_DSADC_GLOBRC_Bits.M5RUN */
#define IFX_DSADC_GLOBRC_M5RUN_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBRC_Bits.M5RUN */
#define IFX_DSADC_GLOBRC_M5RUN_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBRC_Bits.M5RUN */
#define IFX_DSADC_GLOBRC_M5RUN_OFF (21u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN0NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0NVC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN0NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0NVC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN0NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0NVC0_OFF (4u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN0PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0PVC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN0PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0PVC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN0PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN0PVC0_OFF (0u)

