luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDsadc_bf.h
/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN1NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1NVC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN1NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1NVC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN1NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1NVC0_OFF (12u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN1PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1PVC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN1PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1PVC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN1PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN1PVC0_OFF (8u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC0_OFF (20u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC1_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC1_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN2NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2NVC1_OFF (21u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC0_OFF (16u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC1_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC1_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN2PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN2PVC1_OFF (17u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC0_OFF (28u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC1_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC1_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC1_OFF (29u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC2_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC2_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC2_OFF (30u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC3_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC3_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3NVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3NVC3_OFF (31u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC0 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC0_OFF (24u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC1_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC1_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC1 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC1_OFF (25u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC2_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC2_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC2 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC2_OFF (26u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC3_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC3_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH0_Bits.IN3PVC3 */
#define IFX_DSADC_GLOBVCMH0_IN3PVC3_OFF (27u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN4NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4NVC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN4NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4NVC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN4NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4NVC0_OFF (4u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN4PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4PVC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN4PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4PVC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN4PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN4PVC0_OFF (0u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN5NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5NVC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN5NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5NVC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN5NVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5NVC0_OFF (12u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH1_Bits.IN5PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5PVC0_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH1_Bits.IN5PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5PVC0_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH1_Bits.IN5PVC0 */
#define IFX_DSADC_GLOBVCMH1_IN5PVC0_OFF (8u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH2_Bits.VCMHS */
#define IFX_DSADC_GLOBVCMH2_VCMHS_LEN (2u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH2_Bits.VCMHS */
#define IFX_DSADC_GLOBVCMH2_VCMHS_MSK (0x3u)

/** \brief  Offset for Ifx_DSADC_GLOBVCMH2_Bits.VCMHS */
#define IFX_DSADC_GLOBVCMH2_VCMHS_OFF (30u)

/** \brief  Length for Ifx_DSADC_GLOBVCMH2_Bits.VHON */
#define IFX_DSADC_GLOBVCMH2_VHON_LEN (1u)

/** \brief  Mask for Ifx_DSADC_GLOBVCMH2_Bits.VHON */
#define IFX_DSADC_GLOBVCMH2_VHON_MSK (0x1u)

