luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDsadc_bf.h
/** \brief  Offset for Ifx_DSADC_GLOBVCMH2_Bits.VHON */
#define IFX_DSADC_GLOBVCMH2_VHON_OFF (29u)

/** \brief  Length for Ifx_DSADC_ID_Bits.MOD_REV */
#define IFX_DSADC_ID_MOD_REV_LEN (8u)

/** \brief  Mask for Ifx_DSADC_ID_Bits.MOD_REV */
#define IFX_DSADC_ID_MOD_REV_MSK (0xffu)

/** \brief  Offset for Ifx_DSADC_ID_Bits.MOD_REV */
#define IFX_DSADC_ID_MOD_REV_OFF (0u)

/** \brief  Length for Ifx_DSADC_ID_Bits.MOD_TYPE */
#define IFX_DSADC_ID_MOD_TYPE_LEN (8u)

/** \brief  Mask for Ifx_DSADC_ID_Bits.MOD_TYPE */
#define IFX_DSADC_ID_MOD_TYPE_MSK (0xffu)

/** \brief  Offset for Ifx_DSADC_ID_Bits.MOD_TYPE */
#define IFX_DSADC_ID_MOD_TYPE_OFF (8u)

/** \brief  Length for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_DSADC_ID_Bits.MODNUMBER */
#define IFX_DSADC_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_DSADC_KRST0_Bits.RST */
#define IFX_DSADC_KRST0_RST_LEN (1u)

/** \brief  Mask for Ifx_DSADC_KRST0_Bits.RST */
#define IFX_DSADC_KRST0_RST_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_KRST0_Bits.RST */
#define IFX_DSADC_KRST0_RST_OFF (0u)

/** \brief  Length for Ifx_DSADC_KRST0_Bits.RSTSTAT */
#define IFX_DSADC_KRST0_RSTSTAT_LEN (1u)

/** \brief  Mask for Ifx_DSADC_KRST0_Bits.RSTSTAT */
#define IFX_DSADC_KRST0_RSTSTAT_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_KRST0_Bits.RSTSTAT */
#define IFX_DSADC_KRST0_RSTSTAT_OFF (1u)

/** \brief  Length for Ifx_DSADC_KRST1_Bits.RST */
#define IFX_DSADC_KRST1_RST_LEN (1u)

/** \brief  Mask for Ifx_DSADC_KRST1_Bits.RST */
#define IFX_DSADC_KRST1_RST_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_KRST1_Bits.RST */
#define IFX_DSADC_KRST1_RST_OFF (0u)

/** \brief  Length for Ifx_DSADC_KRSTCLR_Bits.CLR */
#define IFX_DSADC_KRSTCLR_CLR_LEN (1u)

/** \brief  Mask for Ifx_DSADC_KRSTCLR_Bits.CLR */
#define IFX_DSADC_KRSTCLR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_KRSTCLR_Bits.CLR */
#define IFX_DSADC_KRSTCLR_CLR_OFF (0u)

/** \brief  Length for Ifx_DSADC_OCS_Bits.SUS */
#define IFX_DSADC_OCS_SUS_LEN (4u)

/** \brief  Mask for Ifx_DSADC_OCS_Bits.SUS */
#define IFX_DSADC_OCS_SUS_MSK (0xfu)

/** \brief  Offset for Ifx_DSADC_OCS_Bits.SUS */
#define IFX_DSADC_OCS_SUS_OFF (24u)

/** \brief  Length for Ifx_DSADC_OCS_Bits.SUS_P */
#define IFX_DSADC_OCS_SUS_P_LEN (1u)

/** \brief  Mask for Ifx_DSADC_OCS_Bits.SUS_P */
#define IFX_DSADC_OCS_SUS_P_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_OCS_Bits.SUS_P */
#define IFX_DSADC_OCS_SUS_P_OFF (28u)

/** \brief  Length for Ifx_DSADC_OCS_Bits.SUSSTA */
#define IFX_DSADC_OCS_SUSSTA_LEN (1u)

/** \brief  Mask for Ifx_DSADC_OCS_Bits.SUSSTA */
#define IFX_DSADC_OCS_SUSSTA_MSK (0x1u)

/** \brief  Offset for Ifx_DSADC_OCS_Bits.SUSSTA */
#define IFX_DSADC_OCS_SUSSTA_OFF (29u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDSADC_BF_H */
